id,question,query
AQ0119,Can you list the models that have been evaluated on the COPA dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""COPA"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ1090,What is the top benchmark score and its metric on the ChemProt dataset?,"SELECT DISTINCT ?metric ?metric_lbl (MAX(?value) AS ?score)
WHERE {
  {
    SELECT ?metric ?metric_lbl ?value
    WHERE {
      ?dataset       a                orkgc:Dataset;
                      rdfs:label       ?dataset_lbl.
      FILTER (str(?dataset_lbl) = ""ChemProt"")
      ?benchmark      orkgp:HAS_DATASET       ?dataset;
                      orkgp:HAS_EVALUATION    ?eval.
      ?eval           orkgp:HAS_VALUE         ?value.
      OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
               ?metric          rdfs:label               ?metric_lbl.}
      ?cont         orkgp:HAS_BENCHMARK      ?benchmark.
      OPTIONAL {?cont      orkgp:HAS_MODEL          ?model.
                ?model      rdfs:label               ?model_lbl.}
    }
    ORDER BY DESC(?value)
  }
}
GROUP BY ?metric ?metric_lbl"
AQ0004,Can you list the models that have been evaluated on the AI-KG dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""AI-KG"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0332,What models are being evaluated on the ModelNet40 dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""ModelNet40"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0160,Can you list the models that have been evaluated on the BIOSSES dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""BIOSSES"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0010,What models are being evaluated on the TSE-NER dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""TSE-NER"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
HQ0040,Which countries are considered in the papers about geopolitics?,"SELECT DISTINCT ?location
WHERE {
  ?_ orkgp:compareContribution [
    orkgp:P32 [
      rdfs:label ?label
    ];
    orkgp:P5049 ?location
  ]
  FILTER(REGEX(STR(?label), ""geopoli?tics""))
}"
AQ0057,What are the models that have been benchmarked on the CoNLL04 dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""CoNLL04"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0184,What models are being evaluated on the BC2GM dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""BC2GM"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0183,What models are being evaluated on the BC5CDR-chemical dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""BC5CDR-chemical"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0783,What are the metrics of evaluation over the Multimodal PISA dataset?,"SELECT DISTINCT ?metric ?metric_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""Multimodal PISA"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
           ?metric          rdfs:label               ?metric_lbl.}
}"
AQ1959,List the code links in papers that use the EneRex model in any benchmark?,"SELECT DISTINCT ?code
WHERE {
  ?model    a            orkgc:Model;
            rdfs:label    ?model_lbl.
  FILTER (str(?model_lbl) = ""EneRex"")
  ?benchmark      orkgp:HAS_DATASET        ?dataset.
  ?cont           orkgp:HAS_BENCHMARK      ?benchmark.
  ?cont           orkgp:HAS_MODEL          ?model;
                  orkgp:HAS_SOURCE_CODE    ?code.
}"
AQ0212,Can you list the models that have been evaluated on the CINIC-10 dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""CINIC-10"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0229,What models are being evaluated on the X-Sum dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""X-Sum"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0273,What models are being evaluated on the Atari 2600 Tennis dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""Atari 2600 Tennis"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
HQ0061,Which vegetables are utilized for betanin extraction?,"SELECT ?vegetables, ?vegetables_labels
WHERE {
  orkgr:R75363 orkgp:compareContribution ?contrib.
  ?contrib orkgp:P35147 ?compounds.
  ?compounds rdfs:label ?compounds_labels.
  FILTER(REGEX(?compounds_labels, ""etanin""))
  ?contrib orkgp:P35148 ?vegetables.
  ?vegetables rdfs:label ?vegetables_labels.
}"
HQ0086,What are the research problems Vernier Effect is related to?,"SELECT DISTINCT ?problems, ?problems_labels
WHERE {
  ?papers rdf:type orkgc:Paper.
  ?papers rdfs:label ?papers_labels.
  FILTER(REGEX(?papers_labels, ""Vernier Effect"", ""i""))
  ?papers orkgp:P31 ?contrib.
  ?contrib orkgp:P32 ?problems.
  ?problems rdfs:label ?problems_labels.
}"
AQ0302,Can you list the models that have been evaluated on the HoC dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""HoC"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0870,Can you list the metrics used to evaluate models on the BC2GM dataset?,"SELECT DISTINCT ?metric ?metric_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""BC2GM"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
           ?metric          rdfs:label               ?metric_lbl.}
}"
AQ0099,What models are being evaluated on the HMDB51 (finetuned) dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""HMDB51 (finetuned)"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0308,What models are being evaluated on the Paper Field dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""Paper Field"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0723,What are the metrics of evaluation over the smallNLP-KG dataset?,"SELECT DISTINCT ?metric ?metric_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""smallNLP-KG"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
           ?metric          rdfs:label               ?metric_lbl.}
}"
AQ0826,What are the metrics of evaluation over the Words in Context dataset?,"SELECT DISTINCT ?metric ?metric_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""Words in Context"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
           ?metric          rdfs:label               ?metric_lbl.}
}"
AQ0018,Can you list the models that have been evaluated on the SciERC dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""SciERC"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0985,What are the metrics of evaluation over the Classic dataset?,"SELECT DISTINCT ?metric ?metric_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""Classic"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
           ?metric          rdfs:label               ?metric_lbl.}
}"
AQ0120,What are the models that have been benchmarked on the TriviaQA dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""TriviaQA"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0276,What models are being evaluated on the Atari 2600 Private Eye dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""Atari 2600 Private Eye"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0011,What models are being evaluated on the ORKG-TDM dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""ORKG-TDM"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0075,What models are being evaluated on the WMT2014 English-French dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""WMT2014 English-French"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0690,What are the metrics of evaluation over the AI-KG dataset?,"SELECT DISTINCT ?metric ?metric_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""AI-KG"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
           ?metric          rdfs:label               ?metric_lbl.}
}"
AQ0691,Can you list the metrics used to evaluate models on the SciREX dataset?,"SELECT DISTINCT ?metric ?metric_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""SciREX"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
           ?metric          rdfs:label               ?metric_lbl.}
}"
AQ0766,Can you list the metrics used to evaluate models on the 20NEWS dataset?,"SELECT DISTINCT ?metric ?metric_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""20NEWS"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
           ?metric          rdfs:label               ?metric_lbl.}
}"
AQ0704,Can you list the metrics used to evaluate models on the SciERC dataset?,"SELECT DISTINCT ?metric ?metric_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""SciERC"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
           ?metric          rdfs:label               ?metric_lbl.}
}"
AQ0300,What models are being evaluated on the Recipe dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""Recipe"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ1366,What is the top benchmark score and its metric on the MUTAG dataset?,"SELECT DISTINCT ?metric ?metric_lbl (MAX(?value) AS ?score)
WHERE {
  {
    SELECT ?metric ?metric_lbl ?value
    WHERE {
      ?dataset       a                orkgc:Dataset;
                      rdfs:label       ?dataset_lbl.
      FILTER (str(?dataset_lbl) = ""MUTAG"")
      ?benchmark      orkgp:HAS_DATASET       ?dataset;
                      orkgp:HAS_EVALUATION    ?eval.
      ?eval           orkgp:HAS_VALUE         ?value.
      OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
               ?metric          rdfs:label               ?metric_lbl.}
      ?cont         orkgp:HAS_BENCHMARK      ?benchmark.
      OPTIONAL {?cont      orkgp:HAS_MODEL          ?model.
                ?model      rdfs:label               ?model_lbl.}
    }
    ORDER BY DESC(?value)
  }
}
GROUP BY ?metric ?metric_lbl"
AQ0940,What are the metrics of evaluation over the Atari 2600 Krull dataset?,"SELECT DISTINCT ?metric ?metric_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""Atari 2600 Krull"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
           ?metric          rdfs:label               ?metric_lbl.}
}"
AQ1137,What is the top benchmark score and its metric on the DROP Test dataset?,"SELECT DISTINCT ?metric ?metric_lbl (MAX(?value) AS ?score)
WHERE {
  {
    SELECT ?metric ?metric_lbl ?value
    WHERE {
      ?dataset       a                orkgc:Dataset;
                      rdfs:label       ?dataset_lbl.
      FILTER (str(?dataset_lbl) = ""DROP Test"")
      ?benchmark      orkgp:HAS_DATASET       ?dataset;
                      orkgp:HAS_EVALUATION    ?eval.
      ?eval           orkgp:HAS_VALUE         ?value.
      OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
               ?metric          rdfs:label               ?metric_lbl.}
      ?cont         orkgp:HAS_BENCHMARK      ?benchmark.
      OPTIONAL {?cont      orkgp:HAS_MODEL          ?model.
                ?model      rdfs:label               ?model_lbl.}
    }
    ORDER BY DESC(?value)
  }
}
GROUP BY ?metric ?metric_lbl"
AQ0819,What are the metrics of evaluation over the RotoWire dataset?,"SELECT DISTINCT ?metric ?metric_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""RotoWire"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
           ?metric          rdfs:label               ?metric_lbl.}
}"
AQ1096,What is the top benchmark score and its metric on the NYT24 dataset?,"SELECT DISTINCT ?metric ?metric_lbl (MAX(?value) AS ?score)
WHERE {
  {
    SELECT ?metric ?metric_lbl ?value
    WHERE {
      ?dataset       a                orkgc:Dataset;
                      rdfs:label       ?dataset_lbl.
      FILTER (str(?dataset_lbl) = ""NYT24"")
      ?benchmark      orkgp:HAS_DATASET       ?dataset;
                      orkgp:HAS_EVALUATION    ?eval.
      ?eval           orkgp:HAS_VALUE         ?value.
      OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
               ?metric          rdfs:label               ?metric_lbl.}
      ?cont         orkgp:HAS_BENCHMARK      ?benchmark.
      OPTIONAL {?cont      orkgp:HAS_MODEL          ?model.
                ?model      rdfs:label               ?model_lbl.}
    }
    ORDER BY DESC(?value)
  }
}
GROUP BY ?metric ?metric_lbl"
AQ0216,What are the models that have been benchmarked on the AAPD dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""AAPD"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0071,What models are being evaluated on the CIFAR-10 dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""CIFAR-10"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0733,Can you list the metrics used to evaluate models on the Twitter dataset?,"SELECT DISTINCT ?metric ?metric_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""Twitter"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
           ?metric          rdfs:label               ?metric_lbl.}
}"
AQ1072,What is the top benchmark score and its metric on the nuScenes dataset?,"SELECT DISTINCT ?metric ?metric_lbl (MAX(?value) AS ?score)
WHERE {
  {
    SELECT ?metric ?metric_lbl ?value
    WHERE {
      ?dataset       a                orkgc:Dataset;
                      rdfs:label       ?dataset_lbl.
      FILTER (str(?dataset_lbl) = ""nuScenes"")
      ?benchmark      orkgp:HAS_DATASET       ?dataset;
                      orkgp:HAS_EVALUATION    ?eval.
      ?eval           orkgp:HAS_VALUE         ?value.
      OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
               ?metric          rdfs:label               ?metric_lbl.}
      ?cont         orkgp:HAS_BENCHMARK      ?benchmark.
      OPTIONAL {?cont      orkgp:HAS_MODEL          ?model.
                ?model      rdfs:label               ?model_lbl.}
    }
    ORDER BY DESC(?value)
  }
}
GROUP BY ?metric ?metric_lbl"
AQ0144,What are the models that have been benchmarked on the ANLI test dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""ANLI test"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ2464,Can you list benchmarked problems in the area of Information Science?,"SELECT DISTINCT ?problem ?problem_lbl
WHERE {
  ?rf       a            orkgc:ResearchField;
            rdfs:label   ?rf_label.
  FILTER (str(?rf_label) = ""Information Science"")
  ?paper    orkgp:P30    ?rf;
            orkgp:P31    ?cont.
  ?cont         orkgp:HAS_BENCHMARK      ?benchmark;
                orkgp:P32                ?problem.
  ?problem      rdfs:label               ?problem_lbl.
}"
AQ0005,Can you list the models that have been evaluated on the SciREX dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""SciREX"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0025,What are the models that have been benchmarked on the SciFACT dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""SciFACT"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0111,Can you list the models that have been evaluated on the BioASQ dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""BioASQ"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0047,What are the models that have been benchmarked on the Twitter dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""Twitter"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0012,What models are being evaluated on the TDM Tagged Corpus dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""TDM Tagged Corpus"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0050,What models are being evaluated on the Amazon-5 dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""Amazon-5"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0127,What are the models that have been benchmarked on the SQuAD2.0 dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""SQuAD2.0"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
HQ0072,What is the most common drug in the studies?,"SELECT ?drug, ?drug_labels
WHERE {
  orkgr:R155621 orkgp:compareContribution ?contrib.
  ?contrib orkgp:P37578 ?drug.
  ?drug rdfs:label ?drug_labels.
}
ORDER BY DESC(COUNT(?drug))
LIMIT 1"
AQ0288,What models are being evaluated on the Atari 2600 Star Gunner dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""Atari 2600 Star Gunner"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0264,What models are being evaluated on the Atari 2600 Bank Heist dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""Atari 2600 Bank Heist"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ1349,What is the top benchmark result (metric and value) over the dataset SVHN?,"SELECT DISTINCT ?metric ?metric_lbl (MAX(?value) AS ?score)
WHERE {
  {
    SELECT ?metric ?metric_lbl ?value
    WHERE {
      ?dataset       a                orkgc:Dataset;
                      rdfs:label       ?dataset_lbl.
      FILTER (str(?dataset_lbl) = ""SVHN"")
      ?benchmark      orkgp:HAS_DATASET       ?dataset;
                      orkgp:HAS_EVALUATION    ?eval.
      ?eval           orkgp:HAS_VALUE         ?value.
      OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
               ?metric          rdfs:label               ?metric_lbl.}
      ?cont         orkgp:HAS_BENCHMARK      ?benchmark.
      OPTIONAL {?cont      orkgp:HAS_MODEL          ?model.
                ?model      rdfs:label               ?model_lbl.}
    }
    ORDER BY DESC(?value)
  }
}
GROUP BY ?metric ?metric_lbl"
AQ0161,What models are being evaluated on the ImageNet dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""ImageNet"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0916,Can you list the metrics used to evaluate models on the arXiv dataset?,"SELECT DISTINCT ?metric ?metric_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""arXiv"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
           ?metric          rdfs:label               ?metric_lbl.}
}"
