id,question,query
AQ2461,Can you list benchmarked problems in the area of Semantic Web?,"SELECT DISTINCT ?problem ?problem_lbl
WHERE {
  ?rf       a            orkgc:ResearchField;
            rdfs:label   ?rf_label.
  FILTER (str(?rf_label) = ""Semantic Web"")
  ?paper    orkgp:P30    ?rf;
            orkgp:P31    ?cont.
  ?cont         orkgp:HAS_BENCHMARK      ?benchmark;
                orkgp:P32                ?problem.
  ?problem      rdfs:label               ?problem_lbl.
}"
AQ0133,What models are being evaluated on the RotoWire dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""RotoWire"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ1060,What is the top benchmark score and its metric on the ART/CoreSC dataset?,"SELECT DISTINCT ?metric ?metric_lbl (MAX(?value) AS ?score)
WHERE {
  {
    SELECT ?metric ?metric_lbl ?value
    WHERE {
      ?dataset       a                orkgc:Dataset;
                      rdfs:label       ?dataset_lbl.
      FILTER (str(?dataset_lbl) = ""ART/CoreSC"")
      ?benchmark      orkgp:HAS_DATASET       ?dataset;
                      orkgp:HAS_EVALUATION    ?eval.
      ?eval           orkgp:HAS_VALUE         ?value.
      OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
               ?metric          rdfs:label               ?metric_lbl.}
      ?cont         orkgp:HAS_BENCHMARK      ?benchmark.
      OPTIONAL {?cont      orkgp:HAS_MODEL          ?model.
                ?model      rdfs:label               ?model_lbl.}
    }
    ORDER BY DESC(?value)
  }
}
GROUP BY ?metric ?metric_lbl"
HQ0020,Which ontology has the most classes?,"SELECT ?ont ?ont_label
WHERE {
  orkgr:R8342 orkgp:compareContribution ?cont.
  ?cont orkgp:P7034 ?ont.
  ?ont orkgp:P7038 ?cls_cnt;
       rdfs:label ?ont_label.
}
ORDER BY DESC(MAX(xsd:int(?cls_cnt)))
LIMIT 1"
AQ0338,What are the models that have been benchmarked on the REDDIT-B dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""REDDIT-B"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0917,What are the metrics of evaluation over the GigaWord dataset?,"SELECT DISTINCT ?metric ?metric_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""GigaWord"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
           ?metric          rdfs:label               ?metric_lbl.}
}"
HQ0062,What are the objectives for Sepsis prediction?,"SELECT DISTINCT ?objectives
WHERE {
  orkgr:R70642 orkgp:compareContribution ?contrib.
  ?contrib orkgp:P15051 ?objectives.
}"
AQ1164,What is the top benchmark result (metric and value) over the dataset PIQA?,"SELECT DISTINCT ?metric ?metric_lbl (MAX(?value) AS ?score)
WHERE {
  {
    SELECT ?metric ?metric_lbl ?value
    WHERE {
      ?dataset       a                orkgc:Dataset;
                      rdfs:label       ?dataset_lbl.
      FILTER (str(?dataset_lbl) = ""PIQA"")
      ?benchmark      orkgp:HAS_DATASET       ?dataset;
                      orkgp:HAS_EVALUATION    ?eval.
      ?eval           orkgp:HAS_VALUE         ?value.
      OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
               ?metric          rdfs:label               ?metric_lbl.}
      ?cont         orkgp:HAS_BENCHMARK      ?benchmark.
      OPTIONAL {?cont      orkgp:HAS_MODEL          ?model.
                ?model      rdfs:label               ?model_lbl.}
    }
    ORDER BY DESC(?value)
  }
}
GROUP BY ?metric ?metric_lbl"
AQ0831,What are the metrics of evaluation over the MedNLI dataset?,"SELECT DISTINCT ?metric ?metric_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""MedNLI"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
           ?metric          rdfs:label               ?metric_lbl.}
}"
AQ1196,What is the top benchmark score and its metric on the CoNLL 2012 dataset?,"SELECT DISTINCT ?metric ?metric_lbl (MAX(?value) AS ?score)
WHERE {
  {
    SELECT ?metric ?metric_lbl ?value
    WHERE {
      ?dataset       a                orkgc:Dataset;
                      rdfs:label       ?dataset_lbl.
      FILTER (str(?dataset_lbl) = ""CoNLL 2012"")
      ?benchmark      orkgp:HAS_DATASET       ?dataset;
                      orkgp:HAS_EVALUATION    ?eval.
      ?eval           orkgp:HAS_VALUE         ?value.
      OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
               ?metric          rdfs:label               ?metric_lbl.}
      ?cont         orkgp:HAS_BENCHMARK      ?benchmark.
      OPTIONAL {?cont      orkgp:HAS_MODEL          ?model.
                ?model      rdfs:label               ?model_lbl.}
    }
    ORDER BY DESC(?value)
  }
}
GROUP BY ?metric ?metric_lbl"
AQ0757,What are the metrics of evaluation over the CIFAR-10 dataset?,"SELECT DISTINCT ?metric ?metric_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""CIFAR-10"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
           ?metric          rdfs:label               ?metric_lbl.}
}"
AQ0058,Can you list the models that have been evaluated on the ACE 2004 dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""ACE 2004"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0070,Can you list the models that have been evaluated on the AG News dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""AG News"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ1100,What is the top benchmark score and its metric on the CIFAR-10 dataset?,"SELECT DISTINCT ?metric ?metric_lbl (MAX(?value) AS ?score)
WHERE {
  {
    SELECT ?metric ?metric_lbl ?value
    WHERE {
      ?dataset       a                orkgc:Dataset;
                      rdfs:label       ?dataset_lbl.
      FILTER (str(?dataset_lbl) = ""CIFAR-10"")
      ?benchmark      orkgp:HAS_DATASET       ?dataset;
                      orkgp:HAS_EVALUATION    ?eval.
      ?eval           orkgp:HAS_VALUE         ?value.
      OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
               ?metric          rdfs:label               ?metric_lbl.}
      ?cont         orkgp:HAS_BENCHMARK      ?benchmark.
      OPTIONAL {?cont      orkgp:HAS_MODEL          ?model.
                ?model      rdfs:label               ?model_lbl.}
    }
    ORDER BY DESC(?value)
  }
}
GROUP BY ?metric ?metric_lbl"
AQ0150,Can you list the models that have been evaluated on the LAMBADA dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""LAMBADA"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0227,What are the models that have been benchmarked on the WSC dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""WSC"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
HQ0075,What is the average efficency for experiments?,"SELECT AVG(?efficency_values)
WHERE {
  orkgr:R155266 orkgp:compareContribution ?contrib.
  ?contrib orkgp:P43156 ?efficency.
  ?efficency rdfs:label ?efficency_labels.
  BIND(xsd:float(?efficency_labels) AS ?efficency_values)
}"
HQ0082,What is another name for Bisphenol A?,"SELECT ?same_name_label
WHERE {
  ?resources rdfs:label ?resources_labels.
  FILTER(REGEX(?resources_labels, ""Bisphenol A"", ""i""))
  ?resources orkgp:SAME_AS ?same_name.
  ?same_name rdfs:label ?same_name_label.
}"
AQ1026,Can you list the metrics used to evaluate models on the IMDb-B dataset?,"SELECT DISTINCT ?metric ?metric_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""IMDb-B"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
           ?metric          rdfs:label               ?metric_lbl.}
}"
AQ0971,What are the metrics of evaluation over the Atari 2600 Q*Bert dataset?,"SELECT DISTINCT ?metric ?metric_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""Atari 2600 Q*Bert"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
           ?metric          rdfs:label               ?metric_lbl.}
}"
AQ1081,What is the top benchmark score and its metric on the TACRED dataset?,"SELECT DISTINCT ?metric ?metric_lbl (MAX(?value) AS ?score)
WHERE {
  {
    SELECT ?metric ?metric_lbl ?value
    WHERE {
      ?dataset       a                orkgc:Dataset;
                      rdfs:label       ?dataset_lbl.
      FILTER (str(?dataset_lbl) = ""TACRED"")
      ?benchmark      orkgp:HAS_DATASET       ?dataset;
                      orkgp:HAS_EVALUATION    ?eval.
      ?eval           orkgp:HAS_VALUE         ?value.
      OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
               ?metric          rdfs:label               ?metric_lbl.}
      ?cont         orkgp:HAS_BENCHMARK      ?benchmark.
      OPTIONAL {?cont      orkgp:HAS_MODEL          ?model.
                ?model      rdfs:label               ?model_lbl.}
    }
    ORDER BY DESC(?value)
  }
}
GROUP BY ?metric ?metric_lbl"
AQ0022,Can you list the models that have been evaluated on the ACL-ARC dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""ACL-ARC"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
HQ0083,What is the amount of questions for LC-QuAD 2.0 dataset?,"SELECT ?number_of_questions
WHERE {
  orkgr:R154290 orkgp:P31 ?contrib.
  ?contrib orkgp:P41923 ?number_of_questions.
}"
AQ1326,What is the top benchmark score and its metric on the BBCSport dataset?,"SELECT DISTINCT ?metric ?metric_lbl (MAX(?value) AS ?score)
WHERE {
  {
    SELECT ?metric ?metric_lbl ?value
    WHERE {
      ?dataset       a                orkgc:Dataset;
                      rdfs:label       ?dataset_lbl.
      FILTER (str(?dataset_lbl) = ""BBCSport"")
      ?benchmark      orkgp:HAS_DATASET       ?dataset;
                      orkgp:HAS_EVALUATION    ?eval.
      ?eval           orkgp:HAS_VALUE         ?value.
      OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
               ?metric          rdfs:label               ?metric_lbl.}
      ?cont         orkgp:HAS_BENCHMARK      ?benchmark.
      OPTIONAL {?cont      orkgp:HAS_MODEL          ?model.
                ?model      rdfs:label               ?model_lbl.}
    }
    ORDER BY DESC(?value)
  }
}
GROUP BY ?metric ?metric_lbl"
HQ0065,What is the maximum egg mass in studies?,"SELECT MAX(?egg_masses_float)
WHERE {
  orkgr:R34845 orkgp:compareContribution ?contrib.
  ?contrib orkgp:P15692 ?egg_masses.
  BIND(xsd:float(?egg_masses) AS ?egg_masses_float)
}"
AQ0113,What models are being evaluated on the CoQA dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""CoQA"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0228,What models are being evaluated on the Barabasi-Albert dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""Barabasi-Albert"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0174,Can you list the models that have been evaluated on the DCASE dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""DCASE"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0860,What are the metrics of evaluation over the DCASE dataset?,"SELECT DISTINCT ?metric ?metric_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""DCASE"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
           ?metric          rdfs:label               ?metric_lbl.}
}"
HQ0074,For what product minimum conversion was obtained?,"SELECT ?product, ?product_label
WHERE {
  orkgr:R155272 orkgp:compareContribution ?contrib.
  ?contrib orkgp:P43149 ?product;
           orkgp:P43148 ?conversion.
  ?product rdfs:label ?product_label.
  ?conversion rdfs:label ?conversion_label.
}
ORDER BY ASC(xsd:float(?conversion_label))
LIMIT 1"
AQ0054,What are the models that have been benchmarked on the NYT dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""NYT"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0875,Can you list the metrics used to evaluate models on the BC5CDR dataset?,"SELECT DISTINCT ?metric ?metric_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""BC5CDR"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
           ?metric          rdfs:label               ?metric_lbl.}
}"
AQ0695,What are the metrics of evaluation over the AAN Corpus dataset?,"SELECT DISTINCT ?metric ?metric_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""AAN Corpus"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
           ?metric          rdfs:label               ?metric_lbl.}
}"
AQ0135,What models are being evaluated on the PIQA dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""PIQA"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0304,What are the models that have been benchmarked on the WOS-46985 dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""WOS-46985"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
HQ0018,Which methods are used?,"SELECT DISTINCT ?methods, ?methods_labels
WHERE {
  orkgr:R110361 orkgp:compareContribution ?cont.
  ?cont orkgp:HAS_METHOD ?methods.
  ?methods rdfs:label ?methods_labels.
}"
HQ0089,Does FEEM Sustainability Index consider air quality?,"ASK {
  ?papers rdf:type orkgc:Paper.
  ?papers rdfs:label ?papers_labels.
  FILTER(REGEX(?papers_labels, ""FEEM Sustainability Index""))
  ?papers orkgp:P31 ?contrib.
  ?contrib ?properties ?properties_values.
  ?properties rdfs:label ?properties_labels.
  FILTER(REGEX(?properties_labels, ""air quality"", ""i""))
  FILTER(?properties_values = ""yes"")
}"
AQ0108,What models are being evaluated on the DROP Test dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""DROP Test"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
HQ0092,Does ViCoMap support aggregation?,"SELECT ?has_aggregation_support
WHERE {
  ?application rdfs:label ""ViCoMap""^^xsd:string;
               orkgp:P5038 ?has_aggregation_support_.
  BIND(
    IF(?has_aggregation_support_ = ""T""^^xsd:string, ""yes"", ""no"")
    AS ?has_aggregation_support
  )
}"
AQ0303,What models are being evaluated on the WOS-5736 dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""WOS-5736"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ1157,What is the top benchmark score and its metric on the SearchQA dataset?,"SELECT DISTINCT ?metric ?metric_lbl (MAX(?value) AS ?score)
WHERE {
  {
    SELECT ?metric ?metric_lbl ?value
    WHERE {
      ?dataset       a                orkgc:Dataset;
                      rdfs:label       ?dataset_lbl.
      FILTER (str(?dataset_lbl) = ""SearchQA"")
      ?benchmark      orkgp:HAS_DATASET       ?dataset;
                      orkgp:HAS_EVALUATION    ?eval.
      ?eval           orkgp:HAS_VALUE         ?value.
      OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
               ?metric          rdfs:label               ?metric_lbl.}
      ?cont         orkgp:HAS_BENCHMARK      ?benchmark.
      OPTIONAL {?cont      orkgp:HAS_MODEL          ?model.
                ?model      rdfs:label               ?model_lbl.}
    }
    ORDER BY DESC(?value)
  }
}
GROUP BY ?metric ?metric_lbl"
AQ0258,What models are being evaluated on the Atari 2600 Enduro dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""Atari 2600 Enduro"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0104,What models are being evaluated on the CUB-200-2011 dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""CUB-200-2011"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0044,What models are being evaluated on the Pubmed dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""Pubmed"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0125,What models are being evaluated on the SQuAD2.0 dev dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""SQuAD2.0 dev"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0743,Can you list the metrics used to evaluate models on the CoNLL04 dataset?,"SELECT DISTINCT ?metric ?metric_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""CoNLL04"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
           ?metric          rdfs:label               ?metric_lbl.}
}"
AQ0068,What are the models that have been benchmarked on the DDI dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""DDI"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ1101,What is the top benchmark score and its metric on the CIFAR-100 dataset?,"SELECT DISTINCT ?metric ?metric_lbl (MAX(?value) AS ?score)
WHERE {
  {
    SELECT ?metric ?metric_lbl ?value
    WHERE {
      ?dataset       a                orkgc:Dataset;
                      rdfs:label       ?dataset_lbl.
      FILTER (str(?dataset_lbl) = ""CIFAR-100"")
      ?benchmark      orkgp:HAS_DATASET       ?dataset;
                      orkgp:HAS_EVALUATION    ?eval.
      ?eval           orkgp:HAS_VALUE         ?value.
      OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
               ?metric          rdfs:label               ?metric_lbl.}
      ?cont         orkgp:HAS_BENCHMARK      ?benchmark.
      OPTIONAL {?cont      orkgp:HAS_MODEL          ?model.
                ?model      rdfs:label               ?model_lbl.}
    }
    ORDER BY DESC(?value)
  }
}
GROUP BY ?metric ?metric_lbl"
AQ0200,What models are being evaluated on the Cart Pole (OpenAI Gym) dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""Cart Pole (OpenAI Gym)"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0093,What models are being evaluated on the Fashion-MNIST dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""Fashion-MNIST"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0239,What models are being evaluated on the Atari-57 dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""Atari-57"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0052,What are the models that have been benchmarked on the TACRED dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""TACRED"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ2440,List the code links in papers that use the KNN model in any benchmark?,"SELECT DISTINCT ?code
WHERE {
  ?model    a            orkgc:Model;
            rdfs:label    ?model_lbl.
  FILTER (str(?model_lbl) = ""KNN"")
  ?benchmark      orkgp:HAS_DATASET        ?dataset.
  ?cont           orkgp:HAS_BENCHMARK      ?benchmark.
  ?cont           orkgp:HAS_MODEL          ?model;
                  orkgp:HAS_SOURCE_CODE    ?code.
}"
AQ0755,What are the metrics of evaluation over the CoLA dataset?,"SELECT DISTINCT ?metric ?metric_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""CoLA"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
           ?metric          rdfs:label               ?metric_lbl.}
}"
AQ1099,What is the top benchmark score and its metric on the AG News dataset?,"SELECT DISTINCT ?metric ?metric_lbl (MAX(?value) AS ?score)
WHERE {
  {
    SELECT ?metric ?metric_lbl ?value
    WHERE {
      ?dataset       a                orkgc:Dataset;
                      rdfs:label       ?dataset_lbl.
      FILTER (str(?dataset_lbl) = ""AG News"")
      ?benchmark      orkgp:HAS_DATASET       ?dataset;
                      orkgp:HAS_EVALUATION    ?eval.
      ?eval           orkgp:HAS_VALUE         ?value.
      OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
               ?metric          rdfs:label               ?metric_lbl.}
      ?cont         orkgp:HAS_BENCHMARK      ?benchmark.
      OPTIONAL {?cont      orkgp:HAS_MODEL          ?model.
                ?model      rdfs:label               ?model_lbl.}
    }
    ORDER BY DESC(?value)
  }
}
GROUP BY ?metric ?metric_lbl"
AQ0337,What are the models that have been benchmarked on the MUTAG dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""MUTAG"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ1028,What are the metrics of evaluation over the Open Entity dataset?,"SELECT DISTINCT ?metric ?metric_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""Open Entity"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
           ?metric          rdfs:label               ?metric_lbl.}
}"
AQ0271,What models are being evaluated on the Atari 2600 Ice Hockey dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""Atari 2600 Ice Hockey"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0069,What models are being evaluated on the CoLA dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""CoLA"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
