id,question,query
AQ0105,What models are being evaluated on the Hendrycks Test dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""Hendrycks Test"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0854,What are the metrics of evaluation over the STS Benchmark dataset?,"SELECT DISTINCT ?metric ?metric_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""STS Benchmark"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
           ?metric          rdfs:label               ?metric_lbl.}
}"
AQ2392,List the code links in papers that use the SWWAE model in any benchmark?,"SELECT DISTINCT ?code
WHERE {
  ?model    a            orkgc:Model;
            rdfs:label    ?model_lbl.
  FILTER (str(?model_lbl) = ""SWWAE"")
  ?benchmark      orkgp:HAS_DATASET        ?dataset.
  ?cont           orkgp:HAS_BENCHMARK      ?benchmark.
  ?cont           orkgp:HAS_MODEL          ?model;
                  orkgp:HAS_SOURCE_CODE    ?code.
}"
AQ0310,What are the models that have been benchmarked on the SciCite dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""SciCite"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0320,Can you list the models that have been evaluated on the SVHN dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""SVHN"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
HQ0093,What are the research problems of the cultural history field?,"SELECT DISTINCT ?research_problems, ?research_problems_labels
WHERE {
  ?papers rdf:type orkgc:Paper.
  ?papers orkgp:P30 ?research_fields.
  ?research_fields rdfs:label ?research_fields_labels. 
  FILTER(REGEX(?research_fields_labels, ""cultural history"", ""i""))
  ?papers orkgp:P31 ?contrib.
  ?contrib orkgp:P32 ?research_problems.
  ?research_problems rdfs:label ?research_problems_labels.
}"
AQ0315,What models are being evaluated on the iNaturalist 2019 dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""iNaturalist 2019"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
HQ0094,Who are the co-authors of Kurt Thomas?,"SELECT ?co_authors
WHERE {
  ?papers rdf:type orkgc:Paper.
  ?papers orkgp:P27 ?authors.
  FILTER(REGEX(?authors, ""Kurt Thomas""))
  ?papers orkgp:P27 ?co_authors.
  FILTER(?co_authors != ""Kurt Thomas""^^xsd:string)
}"
AQ0116,What models are being evaluated on the SQuAD1.1 dev dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""SQuAD1.1 dev"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
HQ0025,Which scholarly knowledge graphs support RDF?,"SELECT ?title
WHERE {
  orkgr:R78023 orkgp:compareContribution ?cont.
  ?cont orkgp:P7009 ?has_rdf.
  FILTER(REGEX(?has_rdf, ""T""))
  ?cont rdfs:label ?title
}"
HQ0029,How many studies are published after 2019?,"SELECT (COUNT(?date) AS ?number_of_studies)
WHERE {
  orkgr:R110393 orkgp:compareContribution ?contrib.
  ?contrib orkgp:P9040 ?date.
  filter(?date > ""2019""^^xsd:string)
}"
AQ0711,What are the metrics of evaluation over the SciFACT dataset?,"SELECT DISTINCT ?metric ?metric_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""SciFACT"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
           ?metric          rdfs:label               ?metric_lbl.}
}"
AQ0066,What are the models that have been benchmarked on the WLPC dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""WLPC"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0295,What are the models that have been benchmarked on the TREC-6 dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""TREC-6"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0189,Can you list the models that have been evaluated on the BC5CDR dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""BC5CDR"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ1992,List the code links in papers that use the WDec model in any benchmark?,"SELECT DISTINCT ?code
WHERE {
  ?model    a            orkgc:Model;
            rdfs:label    ?model_lbl.
  FILTER (str(?model_lbl) = ""WDec"")
  ?benchmark      orkgp:HAS_DATASET        ?dataset.
  ?cont           orkgp:HAS_BENCHMARK      ?benchmark.
  ?cont           orkgp:HAS_MODEL          ?model;
                  orkgp:HAS_SOURCE_CODE    ?code.
}"
AQ0122,What models are being evaluated on the SQuAD1.1 dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""SQuAD1.1"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0072,What are the models that have been benchmarked on the CIFAR-100 dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""CIFAR-100"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ2447,List the code links in papers that use the DATL model in any benchmark?,"SELECT DISTINCT ?code
WHERE {
  ?model    a            orkgc:Model;
            rdfs:label    ?model_lbl.
  FILTER (str(?model_lbl) = ""DATL"")
  ?benchmark      orkgp:HAS_DATASET        ?dataset.
  ?cont           orkgp:HAS_BENCHMARK      ?benchmark.
  ?cont           orkgp:HAS_MODEL          ?model;
                  orkgp:HAS_SOURCE_CODE    ?code.
}"
HQ0059,Which are five the most common research fields for papers?,"SELECT ?research_field, ?research_field_labels
WHERE {
  ?papers orkgp:P30 ?research_field.
  ?research_field rdfs:label ?research_field_labels.
}
ORDER BY DESC(COUNT(?research_field_labels))
LIMIT 5"
AQ0700,What are the metrics of evaluation over the SoMeSci dataset?,"SELECT DISTINCT ?metric ?metric_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""SoMeSci"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
           ?metric          rdfs:label               ?metric_lbl.}
}"
AQ0149,What models are being evaluated on the enwik8 dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""enwik8"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0802,What are the metrics of evaluation over the SQuAD1.1 dev dataset?,"SELECT DISTINCT ?metric ?metric_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""SQuAD1.1 dev"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
           ?metric          rdfs:label               ?metric_lbl.}
}"
AQ1038,What is the top benchmark score and its metric on the AAN Corpus dataset?,"SELECT DISTINCT ?metric ?metric_lbl (MAX(?value) AS ?score)
WHERE {
  {
    SELECT ?metric ?metric_lbl ?value
    WHERE {
      ?dataset       a                orkgc:Dataset;
                      rdfs:label       ?dataset_lbl.
      FILTER (str(?dataset_lbl) = ""AAN Corpus"")
      ?benchmark      orkgp:HAS_DATASET       ?dataset;
                      orkgp:HAS_EVALUATION    ?eval.
      ?eval           orkgp:HAS_VALUE         ?value.
      OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
               ?metric          rdfs:label               ?metric_lbl.}
      ?cont         orkgp:HAS_BENCHMARK      ?benchmark.
      OPTIONAL {?cont      orkgp:HAS_MODEL          ?model.
                ?model      rdfs:label               ?model_lbl.}
    }
    ORDER BY DESC(?value)
  }
}
GROUP BY ?metric ?metric_lbl"
HQ0044,What is the total number of species examined in the studies?,"SELECT (SUM(?number) AS ?total)
WHERE {
  orkgr:R58002 orkgp:compareContribution ?contrib.
  ?contrib orkgp:P31024 ?number_of_species.
  BIND(xsd:integer(?number_of_species) AS ?number)
}"
AQ1170,What is the top benchmark score and its metric on the RTE dataset?,"SELECT DISTINCT ?metric ?metric_lbl (MAX(?value) AS ?score)
WHERE {
  {
    SELECT ?metric ?metric_lbl ?value
    WHERE {
      ?dataset       a                orkgc:Dataset;
                      rdfs:label       ?dataset_lbl.
      FILTER (str(?dataset_lbl) = ""RTE"")
      ?benchmark      orkgp:HAS_DATASET       ?dataset;
                      orkgp:HAS_EVALUATION    ?eval.
      ?eval           orkgp:HAS_VALUE         ?value.
      OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
               ?metric          rdfs:label               ?metric_lbl.}
      ?cont         orkgp:HAS_BENCHMARK      ?benchmark.
      OPTIONAL {?cont      orkgp:HAS_MODEL          ?model.
                ?model      rdfs:label               ?model_lbl.}
    }
    ORDER BY DESC(?value)
  }
}
GROUP BY ?metric ?metric_lbl"
AQ0827,Can you list the metrics used to evaluate models on the RTE dataset?,"SELECT DISTINCT ?metric ?metric_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""RTE"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
           ?metric          rdfs:label               ?metric_lbl.}
}"
AQ0126,What models are being evaluated on the Natural Questions (long) dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""Natural Questions (long)"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0913,Can you list the metrics used to evaluate models on the WSC dataset?,"SELECT DISTINCT ?metric ?metric_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""WSC"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
           ?metric          rdfs:label               ?metric_lbl.}
}"
HQ0036,What is the full name of the EXPO ontology?,"SELECT ?full_name
WHERE {
  orkgr:R8342 orkgp:compareContribution ?cont.
  ?cont orkgp:P7034 ?ontology.
  ?ontology rdfs:label ?ont_lbl;
            orkgp:P7035 ?full_name. 
  FILTER(REGEX(STR(?ont_lbl), ""expo"", ""i""))
}"
HQ0073,Do all studies include open ocean sampling?,"ASK {
  {
    SELECT (COUNT(?ocean_sampling) AS ?counter)
    WHERE {
      orkgr:R155561 orkgp:compareContribution ?contrib.
      ?contrib orkgp:P41379 ?ocean_sampling.
      FILTER(?ocean_sampling = ""F""^^xsd:string)
    }
  }
  FILTER(?counter = 0)
}"
AQ0967,What are the metrics of evaluation over the Atari 2600 Boxing dataset?,"SELECT DISTINCT ?metric ?metric_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""Atari 2600 Boxing"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
           ?metric          rdfs:label               ?metric_lbl.}
}"
AQ0256,What models are being evaluated on the Atari 2600 Freeway dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""Atari 2600 Freeway"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ1151,What is the top benchmark score and its metric on the SQuAD1.1 dataset?,"SELECT DISTINCT ?metric ?metric_lbl (MAX(?value) AS ?score)
WHERE {
  {
    SELECT ?metric ?metric_lbl ?value
    WHERE {
      ?dataset       a                orkgc:Dataset;
                      rdfs:label       ?dataset_lbl.
      FILTER (str(?dataset_lbl) = ""SQuAD1.1"")
      ?benchmark      orkgp:HAS_DATASET       ?dataset;
                      orkgp:HAS_EVALUATION    ?eval.
      ?eval           orkgp:HAS_VALUE         ?value.
      OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
               ?metric          rdfs:label               ?metric_lbl.}
      ?cont         orkgp:HAS_BENCHMARK      ?benchmark.
      OPTIONAL {?cont      orkgp:HAS_MODEL          ?model.
                ?model      rdfs:label               ?model_lbl.}
    }
    ORDER BY DESC(?value)
  }
}
GROUP BY ?metric ?metric_lbl"
HQ0004,Who is responsible for acquisition in the RASH system?,"SELECT ?acq
WHERE {
  orkgr:R8364 orkgp:compareContribution ?cont.
  ?cont orkgp:P7046 orkgr:R8350.
  orkgr:R8350 orkgp:P7049 ?acq.
}"
AQ0855,What are the metrics of evaluation over the SentEval dataset?,"SELECT DISTINCT ?metric ?metric_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""SentEval"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
           ?metric          rdfs:label               ?metric_lbl.}
}"
HQ0010,What metric will be used to evaluate question answering systems?,"SELECT DISTINCT ?name
WHERE {
  [
    orkgp:P34 [
      rdfs:label ?name 
    ]
  ].
  FILTER(STRLEN(?name) > 0)
}
ORDER BY ?name"
HQ0015,What is the maximum sample size?,"SELECT ?sample_size
WHERE {
  orkgr:R135371 orkgp:compareContribution ?cont.
  ?cont orkgp:P15687 ?sample_size
}
ORDER BY DESC(?sample_size)
LIMIT 1"
AQ0862,What are the metrics of evaluation over the UrbanSound8k dataset?,"SELECT DISTINCT ?metric ?metric_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""UrbanSound8k"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
           ?metric          rdfs:label               ?metric_lbl.}
}"
HQ0030,Which toxins do pseudomonas species produce?,"SELECT DISTINCT ?toxins, ?toxins_labels
WHERE {
  orkgr:R69027 orkgp:compareContribution ?contrib.
  ?contrib orkgp:P34037 ?toxins.
  ?toxins rdfs:label ?toxins_labels.
}"
AQ1339,What is the top benchmark score and its metric on the SciCite dataset?,"SELECT DISTINCT ?metric ?metric_lbl (MAX(?value) AS ?score)
WHERE {
  {
    SELECT ?metric ?metric_lbl ?value
    WHERE {
      ?dataset       a                orkgc:Dataset;
                      rdfs:label       ?dataset_lbl.
      FILTER (str(?dataset_lbl) = ""SciCite"")
      ?benchmark      orkgp:HAS_DATASET       ?dataset;
                      orkgp:HAS_EVALUATION    ?eval.
      ?eval           orkgp:HAS_VALUE         ?value.
      OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
               ?metric          rdfs:label               ?metric_lbl.}
      ?cont         orkgp:HAS_BENCHMARK      ?benchmark.
      OPTIONAL {?cont      orkgp:HAS_MODEL          ?model.
                ?model      rdfs:label               ?model_lbl.}
    }
    ORDER BY DESC(?value)
  }
}
GROUP BY ?metric ?metric_lbl"
AQ1055,What is the top benchmark score and its metric on the SciTLDR dataset?,"SELECT DISTINCT ?metric ?metric_lbl (MAX(?value) AS ?score)
WHERE {
  {
    SELECT ?metric ?metric_lbl ?value
    WHERE {
      ?dataset       a                orkgc:Dataset;
                      rdfs:label       ?dataset_lbl.
      FILTER (str(?dataset_lbl) = ""SciTLDR"")
      ?benchmark      orkgp:HAS_DATASET       ?dataset;
                      orkgp:HAS_EVALUATION    ?eval.
      ?eval           orkgp:HAS_VALUE         ?value.
      OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
               ?metric          rdfs:label               ?metric_lbl.}
      ?cont         orkgp:HAS_BENCHMARK      ?benchmark.
      OPTIONAL {?cont      orkgp:HAS_MODEL          ?model.
                ?model      rdfs:label               ?model_lbl.}
    }
    ORDER BY DESC(?value)
  }
}
GROUP BY ?metric ?metric_lbl"
AQ0046,Can you list the models that have been evaluated on the FB15k dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""FB15k"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0137,Can you list the models that have been evaluated on the ARC (Easy) dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""ARC (Easy)"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0728,What are the metrics of evaluation over the MNIST dataset?,"SELECT DISTINCT ?metric ?metric_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""MNIST"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
           ?metric          rdfs:label               ?metric_lbl.}
}"
AQ1089,What is the top benchmark result (metric and value) over the dataset GAD?,"SELECT DISTINCT ?metric ?metric_lbl (MAX(?value) AS ?score)
WHERE {
  {
    SELECT ?metric ?metric_lbl ?value
    WHERE {
      ?dataset       a                orkgc:Dataset;
                      rdfs:label       ?dataset_lbl.
      FILTER (str(?dataset_lbl) = ""GAD"")
      ?benchmark      orkgp:HAS_DATASET       ?dataset;
                      orkgp:HAS_EVALUATION    ?eval.
      ?eval           orkgp:HAS_VALUE         ?value.
      OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
               ?metric          rdfs:label               ?metric_lbl.}
      ?cont         orkgp:HAS_BENCHMARK      ?benchmark.
      OPTIONAL {?cont      orkgp:HAS_MODEL          ?model.
                ?model      rdfs:label               ?model_lbl.}
    }
    ORDER BY DESC(?value)
  }
}
GROUP BY ?metric ?metric_lbl"
AQ2463,Can you list benchmarked problems in the area of Computer Sciences?,"SELECT DISTINCT ?problem ?problem_lbl
WHERE {
  ?rf       a            orkgc:ResearchField;
            rdfs:label   ?rf_label.
  FILTER (str(?rf_label) = ""Computer Sciences"")
  ?paper    orkgp:P30    ?rf;
            orkgp:P31    ?cont.
  ?cont         orkgp:HAS_BENCHMARK      ?benchmark;
                orkgp:P32                ?problem.
  ?problem      rdfs:label               ?problem_lbl.
}"
AQ0751,What are the metrics of evaluation over the ADE Corpus dataset?,"SELECT DISTINCT ?metric ?metric_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""ADE Corpus"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
           ?metric          rdfs:label               ?metric_lbl.}
}"
AQ0749,What are the metrics of evaluation over the NYT-single dataset?,"SELECT DISTINCT ?metric ?metric_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""NYT-single"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
           ?metric          rdfs:label               ?metric_lbl.}
}"
AQ1080,What is the top benchmark score and its metric on the WebNLG dataset?,"SELECT DISTINCT ?metric ?metric_lbl (MAX(?value) AS ?score)
WHERE {
  {
    SELECT ?metric ?metric_lbl ?value
    WHERE {
      ?dataset       a                orkgc:Dataset;
                      rdfs:label       ?dataset_lbl.
      FILTER (str(?dataset_lbl) = ""WebNLG"")
      ?benchmark      orkgp:HAS_DATASET       ?dataset;
                      orkgp:HAS_EVALUATION    ?eval.
      ?eval           orkgp:HAS_VALUE         ?value.
      OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
               ?metric          rdfs:label               ?metric_lbl.}
      ?cont         orkgp:HAS_BENCHMARK      ?benchmark.
      OPTIONAL {?cont      orkgp:HAS_MODEL          ?model.
                ?model      rdfs:label               ?model_lbl.}
    }
    ORDER BY DESC(?value)
  }
}
GROUP BY ?metric ?metric_lbl"
HQ0042,Who is the author of the most recent paper about insects?,"SELECT ?author_name
WHERE {
  {
    SELECT ?publication_date_ AS ?date_of_the_latest_paper {
      ?paper_ a orkgc:Paper;
              rdfs:label ?title_;
              orkgp:P28 ?publication_month_;
              orkgp:P29 ?publication_year_.
      OPTIONAL {
        ?publication_month_ rdfs:label ?publication_month_label_
      }
      OPTIONAL {
        ?publication_year_ rdfs:label ?publication_year_label_
      }
      BIND(
        xsd:integer(
          IF(
            BOUND(?publication_month_label_),
            ?publication_month_label_,
            ?publication_month_
          )
        ) AS ?publication_month_as_number_
      )
      BIND(
        xsd:integer(
          IF(
            BOUND(?publication_year_label_),
            ?publication_year_label_,
            ?publication_year_
          )
        ) AS ?publication_year_as_number_
      )
      BIND(
        xsd:dateTime(
          CONCAT(
            ?publication_year_as_number_,
            ""-"",
            ?publication_month_as_number_,
            ""-01T00:00:00.000-00:00""
          )
        )
        AS ?publication_date_
      )
      FILTER(
        ?publication_month_as_number_ > 0 && ?publication_month_as_number_ < 13 && ?publication_year_as_number_ > 0 && ?publication_year_as_number_ < 2023
      )
      FILTER(REGEX(STR(?title_), ""insect""))
    }
    ORDER BY DESC(?publication_date_)
    LIMIT 1
  }
  ?paper a orkgc:Paper;
           rdfs:label ?title;
           orkgp:P27 ?author;
           orkgp:P28 ?publication_month;
           orkgp:P29 ?publication_year.
  OPTIONAL {
     ?publication_month rdfs:label ?publication_month_label
  }
  OPTIONAL {
    ?publication_year rdfs:label ?publication_year_label
  }
  OPTIONAL {
    ?author rdfs:label ?author_label
  }
  BIND(
    IF(
      BOUND(?author_label),
      ?author_label,
      ?author
    ) AS ?author_name
  )
  BIND(
    xsd:integer(
      IF(
        BOUND(?publication_month_label),
        ?publication_month_label,
        ?publication_month
      )
    ) AS ?publication_month_as_number
  )
  BIND(
    xsd:integer(
      IF(
        BOUND(?publication_year_label),
        ?publication_year_label,
        ?publication_year
      )
    ) AS ?publication_year_as_number
  )
  BIND(
    xsd:dateTime(
      CONCAT(
        ?publication_year_as_number,
        ""-"",
        ?publication_month_as_number,
        ""-01T00:00:00.000-00:00""
      )
    )
    AS ?publication_date
  )
  FILTER(
    ?publication_month_as_number > 0 && ?publication_month_as_number < 13 && ?publication_year_as_number > 0 && ?publication_year_as_number < 2023
  )
  FILTER(
    REGEX(
      STR(?title),
      ""insect""
    ) && ?publication_date = ?date_of_the_latest_paper
  )
}"
HQ0041,What can one use instead of wheat flour?,"SELECT DISTINCT ?flour
WHERE {
  ?_ orkgp:P37571 ?flour.
}"
AQ0055,Can you list the models that have been evaluated on the JNLPBA dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""JNLPBA"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0028,What are the models that have been benchmarked on the CS-NER dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""CS-NER"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0873,What are the metrics of evaluation over the BC5CDR-disease dataset?,"SELECT DISTINCT ?metric ?metric_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""BC5CDR-disease"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  OPTIONAL {?eval           orkgp:HAS_METRIC         ?metric.
           ?metric          rdfs:label               ?metric_lbl.}
}"
HQ0034,How many studies do use Chloride as major anion?,"SELECT COUNT(?anions_labels) AS ?chloride_count
WHERE {
  orkgr:R110597 orkgp:compareContribution ?contrib.
  ?contrib orkgp:P37458 ?anions.
  ?anions rdfs:label ?anions_labels.
  FILTER(REGEX(?anions_labels, ""Chloride""^^xsd:string))
}"
AQ0158,What models are being evaluated on the Text8 dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""Text8"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
AQ0232,What models are being evaluated on the CL-SciSumm dataset?,"SELECT DISTINCT ?model ?model_lbl
WHERE {
  ?dataset       a                orkgc:Dataset;
                  rdfs:label       ?dataset_lbl.
  FILTER (str(?dataset_lbl) = ""CL-SciSumm"")
  ?benchmark      orkgp:HAS_DATASET       ?dataset;
                  orkgp:HAS_EVALUATION    ?eval.
  ?paper         orkgp:HAS_BENCHMARK      ?benchmark.
  OPTIONAL {?paper      orkgp:HAS_MODEL          ?model.
            ?model      rdfs:label               ?model_lbl.}
}"
HQ0060,What are economics subfields?,"SELECT DISTINCT ?subfields, ?subfields_labels
WHERE {
  ?papers orkgp:P30 ?research_fields.
  ?research_fields rdfs:label ""Economics""^^xsd:string.
  ?research_fields orkgp:P36 ?subfields.
  ?subfields rdfs:label ?subfields_labels. 
}"
HQ0048,What is the maximum female percentage?,"SELECT ?female_percantage
WHERE {
  orkgr:R44978 orkgp:compareContribution ?contrib.
  ?contrib orkgp:P23154 ?female_percantage.
}
ORDER BY DESC(?female_percantage)
LIMIT 1"
