[
    {
        "instruction": "The Open Research Knowledge Graph (ORKG) is a semantic knowledge graph designed to represent, compare, and retrieve scholarly contributions. Given a natural language question, your task is to generate the corresponding SPARQL query that can be used to query the ORKG for the correct answer. \nInput Format: \n    Question: A natural language question related to the ORKG.\nOutput Format:\n    SPARQL Query: The corresponding SPARQL query to retrieve the answer from the ORKG.",
        "input": "What research problem is addressed in the paper titled \"6th Open Challenge on Question Answering over Linked Data (QALD-6)\"?\n",
        "output": "SELECT DISTINCT ?concept ?rlabel \nWHERE {\n  orkgr:R6386 orkgp:P31 ?x .\n  ?x orkgp:P32 ?concept.\n  ?concept rdfs:label ?rlabel.\n}\nLIMIT 1"
    },
    {
        "instruction": "The Open Research Knowledge Graph (ORKG) is a semantic knowledge graph designed to represent, compare, and retrieve scholarly contributions. Given a natural language question, your task is to generate the corresponding SPARQL query that can be used to query the ORKG for the correct answer. \nInput Format: \n    Question: A natural language question related to the ORKG.\nOutput Format:\n    SPARQL Query: The corresponding SPARQL query to retrieve the answer from the ORKG.",
        "input": "Does \"ZoomRDF\" uses filters?",
        "output": "SELECT ?uses_filter\nWHERE {\n  ?paper orkgp:P5025 ?filter;\n         rdfs:label ?title.\n  FILTER(REGEX(?title, \"ZoomRDF\"))\n  BIND(\n    IF(?filter = \"T\"^^xsd:string, \"Yes\", \"No\")\n    AS ?uses_filter\n  )\n}"
    },
    {
        "instruction": "The Open Research Knowledge Graph (ORKG) is a semantic knowledge graph designed to represent, compare, and retrieve scholarly contributions. Given a natural language question, your task is to generate the corresponding SPARQL query that can be used to query the ORKG for the correct answer. \nInput Format: \n    Question: A natural language question related to the ORKG.\nOutput Format:\n    SPARQL Query: The corresponding SPARQL query to retrieve the answer from the ORKG.",
        "input": "What is the base URL of \"The Document Components Ontology\"?",
        "output": "SELECT ?iri\nWHERE {\n  orkgr:R8342 orkgp:compareContribution ?cont.\n  ?cont orkgp:P7034 ?ont.\n  ?ont orkgp:P7042 ?iri;\n       orkgp:P7035 ?full_name.\n  FILTER(REGEX(STR(?full_name), \"Document Components Ontology\", \"i\"))\n}"
    }
]